---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExternalEvent Properties
ExternalEvent Class See Also Send Feedback
---

The ExternalEvent type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsPending | Checking whether an event has been raised but not yet executed. |

# See Also

ExternalEvent Class

Autodesk.Revit.UI Namespace